app/Http/Controllers/LibroController.php

select * from `libros` where `titulo` like '%%' and `sinapsis` like '%%' and `pvp` > 50 order by `id` asc limit 5 offset 0
select count(*) as aggregate from `libros` where `titulo` like '%%' and `sinapsis` like '%%' and `pvp` > 20 and `pvp` <= 50
---
    public function index(Request $request)
    {
       $titulo = $request->get('titulo');
       $sinapsis = $request->get('sinapsis');
       $pvp = $request->get('pvp');

       $libros = Libro::orderBy('id')
       ->titulo($titulo)
       ->sinapsis($sinapsis)
       ->pvp($pvp)
       ->paginate(5);